<a href="https://colab.research.google.com/github/Ashraful1Islam/MachineLearning_DataScience/blob/main/Pandas_Series.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [26]:
import numpy as np
import pandas as pd

In [27]:
# Create list of labels and values
# Convert list to NumPy array
#Create dictionary with keys as labels and values as data
labels=['a','b','c']
my_data=[10,20,30]
arr=np.array(my_data)
d={'a':10,'b':20,'c':30}

In [28]:
# Create a Pandas Series from a list (default index will be 0,1,2)
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [29]:
# Create a Series from list with custom labels as index
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [30]:
# Same as above, position of arguments changed
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [31]:
# Create Series from a NumPy array (default index)
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [32]:
# Create Series from a dictionary (keys become index)
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [33]:
# Create Series from a list of strings
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [34]:
# Create Series with Python built-in functions
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [35]:
# Create a Series with country names as index
ser1=pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [36]:
# Create another Series with a slightly different index (Italy instead of USSR)
ser2=pd.Series([1,2,5,4],['USA','Germany','Italy','Japan'])
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [37]:
# Access value for label 'USA' in ser1
ser1['USA']

np.int64(1)

In [38]:
# Create a Series from the labels list (strings as data)
ser3=pd.Series(data=labels)
ser3

0    a
1    b
2    c
dtype: object

In [39]:
# Access first element (index 0) of ser3
ser3[0]

'a'

In [40]:
# Add two Series together (matching by label, not position)
# If a label is missing in either Series, result will be NaN
ser1+ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64